mboros1/esp_raii_lib/sdkconfig.defaults
# Default configuration for ESP32
CONFIG_IDF_TARGET="esp32"

# Enable C++ exceptions (useful for RAII)
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=0

# Enable C++ RTTI
CONFIG_COMPILER_CXX_RTTI=y

# Optimization level
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Enable FreeRTOS stats (useful for debugging)
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y